# from random import randint
# n = 100
# a = [0] * n
# for i in range(n):
#     a[i] = randint(-5000, 5000)
#     print(a[i], end='  ')
# min = a[0]
# for i in range(len(a)):
#     if ((a[i]%9==0) and (a[i]<min)):
#         min = a[i]
#         print(a[i])
#         print(min)
#     else:
#         print(0)

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# from random import randint
# n = 10
# a = [0] * n
# for i in range(n):
#     a[i] = randint(0, 100)
#     if (a[i]%2==0):
#         print(a[i])
#     elif (a[i]%4==0):
#         print(a[i])
#     elif (a[i]==0):
#         print(a[i])
# print(sorted(a))

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# from random import randint
# n = 15
# a = [0] * n
# m = 0
# for i in range(n):
#     a[i] = randint(0, 10000)
#     if (a[i]%2==0):
#         m += a[i]
#         print(m)

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# from random import randint
# import random
# k =15
# a = [random.randint(0,10) for i in range(int(input("Long mas: ")))]
# print(sorted(a))
# # min = a[0]
# # for i in range(len(a)):
# #     if a[i] < min:
# #         min = a[i]
# # print(f"min: {min}")
# for i in range(len(a)):
#     m = a[0]
#     if m + a[i] == k:
#         print(m, a[i])
#         m = a[i + 1]
#     else:
#         print("no")
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# from random import randint
# import random
# n = int(input("Введите количество n: "))
# a = [random.randint(0,10) for i in range(n)]
# print(a)





""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# day = int(input("Введите количество дней: ", ))
# hours = int(input("Введите количество часов: ", ))
# minets = int(input("Введите количество минут: "))
# second = int(input("Введите количество секунд: "))
# d = day * 24 * 60 * 60
# h = hours * 60 * 60
# m = minets * 60
# s = second
# print("Количество секунд: ", f"s = {d+h+m+s}")

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# n = int(input("Введите число: "))
# k = int(input("Сколько цифр оставить? 1-9: "))
# # if k == 1:
# #     print(n%10)
# # elif k == 2:
# #     print(n%100)
# # elif k == 3:
# #     print(n%1000)
# # elif k == 4:
# #     print(n%10000)
# # elif k == 5:
# #     print(n%100000)
# # elif k == 6:
# #     print(n%1000000)
# # elif k == 7:
# #     print(n%10000000)
# # elif k == 8:
# #     print(n%100000000)
# # elif k == 9:
# #     print(n%1000000000)
# print(n%10**k)

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#
# n = int(input("Введите ТРЕХЗНАЧНОЕ число: ", ))
# print(f"{n % 1000 // 100} + {n % 100 // 10} + {n % 10} = {(n % 1000 // 100)+(n % 100 // 10)+(n % 10)}")

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# start = int(input("""Вы находитесь в землях, заселенных драконами. Перед собой вы
# видите две пещеры.
# В одной из них — дружелюбный дракон, который готов поделиться с
# вами своими сокровищами.
# Во второй — жадный и голодный дракон, который мигом вас съест.
# В какую пещеру вы войдете? (нажмите клавишу 1 или 2):  """, ))
# if start == 1:
#     print('Вы приближаетесь к пещере...', start)
#     print('''Ее темнота заставляет вас дрожать от страха...
# Большой дракон выпрыгивает перед вами! Он раскрывает свою
# пасть и...
# Делится с вами своими сокровищами!!!
# ''')
# elif start == 2:
#     print("Вы приближаетесь к пещере...", start)
#     print('''Ее темнота заставляет вас дрожать от страха...
# Большой дракон выпрыгивает перед вами! Он раскрывает свою
# пасть и...
# Моментально вас съедает!!!
# ''')
# else:
#     print("Жульничать плохо!")
#
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# def calendar(day, month, year):
#     if day <= 31 and (month == 1 or month == 3 or month == 5 or month == 7 or month == 8 or month == 10 or month == 12):
#         print("date corect")
#     elif day <= 30 and (month == 4 or month == 6 or month == 9 or month == 11):
#         print("date corect")
#     elif day <=29 and month == 2 and (year % 4 == 0):
#         print('date corect')
#     elif day <= 28 and month == 2 and (year % 4 != 0):
#         print('Not date corect')
#     else:
#         print('ERROR')
#
# day = int(input("День: ",))
# month = int(input('Месяц: ',))
# year = int(input("Год: ",))
# calendar(day, month, year)

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# a = int(input("Введи число ",))
# b = int(input("Введи число ",))
# c = int(input("Введи число ",))
#
# if (a+b)>=c:
#     print("Треугольник существует!")
# elif (b+c)>=a:
#     print("Треугольник существует!")
# elif (a+c)>=b:
#     print("Треугольник существует!")
# else:
#     print("Треугольник не существует!")
#
# print("Проверим какой он: ")
# if (a == b) and (b == c) and (c == a):
#     print("Он равносторонний")
# elif (a == b) or (b == c) or (c == a):
#     print("Он равнобедренный")
# else:
#     print("Всё стороны разной длинны")

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# def number(n):
#     if len(n) != 6 and len(n) != 7:
#         print("Неправильный формат номерного знака.")
#         return
#
#     # Проверка на старый формат (три буквы и три цифры)
#
#     if n[:3].isalpha() and n[3:].isdigit():
#         print("Старый формат номера")
#
#         # Проверка на новый формат (четыре цифры и три буквы)
#
#
#     elif n[:4].isdigit() and n[4:].isalpha():
#         print("Новый формат номера")
#
#     else:
#         print("Неправильный формат")
#
# n = input("Введите номерной знак машины: ").upper()
# number(n)





