# text = '''Довольно распространённая ошибка
# ошибка это лишний повтор повтор
# слова слова Смешно не не правда ли
# Не нужно портить хор хоровод'''
# w = text.split()
# result = []
# for i in range(len(w)):
#     if i == 0 or w[i] != w[i-1]:
#         result.append(w[i])
# tresult = ' '.join(result)
# print(tresult)
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# f = input().split()
# if len(f) == 2:
#     print(f'{f[1]} {f[0]}')
# else:
#     print('ERROR')
# #фразу перевернуть

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

# f = input()
# if len(f) <= 1:
#     print("Не подходит")
# else:
#     g = '.'.join(f)
# print(g)
# #Python

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# r = str()
# f = input()
# r = f.replace('не плохой', 'хороший')
# r = f.replace('не плоха', 'хороша')
# r = f.replace('не плохо', 'хорошо')
# print(r)
# #Книга плохая!
# #Фильм не плохой.

""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# text = input("Введите три строки хайку, разделённые ' / ': ")
# string = text.split(" / ")
# if len(string) != 3:
#     print("Не хайку. Должно быть 3 строки.")
# else:
#     glasn = 'аеёиоуыэюяАЕЁИОУЫЭЮЯ'
#     new_string = []
#     for i in string:
#         count = 0
#         for char in i:
#             if char in glasn:
#                 count += 1
#         new_string.append(count)
#     if new_string == [5, 7, 5]:
#         print("Хайку!")
#     else:
#         print("Не хайку.")
# #Вечер за окном. / Еще один день прожит. / Жизнь скоротечна...
# #Как вишня расцвела! / Она с коня согнала / И князя-гордеца.
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# # Вводим wdor#
# s = input()
# if s[-1] != '#':
#     print("ERROR")
# else:
#     s = s[:-1]
#     l = len(s)
#     for i in range(0, l, 2):
#         print(s[i] , end="")
#     if l % 2 != 0:
#         l -= 1
#     for i in range(l - 1, -1, -2):
#         print(s[i], end="")
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# import random
# alpha = "abcdefghijklmnopqrstuvwxyz"
# Alpha = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
# numbers = "123456789"
# spec = "!@#$%^&*()-_=+[]{}|;:,.<>?/~`"
# array = ""
# long = int(input("Введите длину пароля(целое число): "))
# uslo1 = input("нужны ли заглавные буквы (да/нет):")
# uslo2 = input("нужны ли строчные буквы (да/нет):")
# uslo3 = input("нужны ли цифры (да/нет):")
# uslo4 = input("нужны ли специальные символы (да/нет).")
# if (uslo1 == "да" or "Да" or "ДА"):
#     array += Alpha
# if (uslo2 == "да" or "Да" or "ДА"):
#     array += alpha
# if (uslo3 == "да" or "Да" or "ДА"):
#     array += numbers
# if (uslo4 == "да" or "Да" or "ДА"):
#     array += spec
#
# if len(array) == 0:
#     print("Ошибка: не выбраны символы для генерации пароля.")
# else:
#     password = ""
#     for _ in range(long):
#         password += random.choice(array)
#     print("Сгенерированный пароль:", password)
# print(array)
""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
# import random
# name1 = str(input("Введите название команды №1: ", ))
# name2 = input("Введите название команды №2: ", )
# if name1 == name2:
#     print("ERROR")
# else:
#         chek1 = random.randint(0,10)
#         chek2 = random.randint(0,10)
#         n1 = name1.split()
#         n1.append(chek1)
#         n2 = name2.split()
#         n2.append(chek2)
#         if n1[1] > n2[1]:
#             print(f'Команда {n1[0]} Выйграла!!! Её счёт составил: {n1[1]}')
#             print(f'О.Б.Щ.И.Е. Д.А.Н.Н.Ы.Е. - Команды : {n1[0]}-{n2[0]}, её счёт в матче {n1[1]}:{n2[1]}')
#         elif n1[1] < n2[1]:
#             print(f'Команда {n2[0]} Выйграла!!! Её счёт составил: {n2[1]}')
#             print(f'О.Б.Щ.И.Е. Д.А.Н.Н.Ы.Е. - Команды : {n1[0]}-{n2[0]}, её счёт в матче {n1[1]}:{n2[1]}')
#         else:
#             print("Ничья")
